fotahub/fotahub-device-sdk-esp8266/examples/huzzah/thingshadow/ESP8266AWSIoTThingShadowWiring.c
/*
 *  Copyright (C) 2022 FotaHub Inc. All rights reserved.
 *
 *  Licensed under the Apache License, Version 2.0 (the "License"); you may
 *  not use this file except in compliance with the License.
 *  You may obtain a copy of the License at
 *
 *  http://www.apache.org/licenses/LICENSE-2.0
 *
 *  Unless required by applicable law or agreed to in writing, software
 *  distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 *  WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 *  See the License for the specific language governing permissions and
 *  limitations under the License.
 *
 *  This file is part of the FotaHub(R) Device SDK program (https://fotahub.com)
 */
#include "ESP8266AWSIoTThingShadowWiring.h"

#include "FotaHub.h"
#include "DemoFOTAUpdateWorkflow.h"
#include <string.h>

static inline void ICACHE_FLASH_ATTR awsIoTThingShadowInstances_thingShadowIOHandlerInst__wire(void);

static inline void ICACHE_FLASH_ATTR awsIoTThingShadowInstances_thingShadowStack_thingShadowGateInst__wire(void);

static inline void ICACHE_FLASH_ATTR awsIoTThingShadowInstances_thingShadowStack_awsIoTMQTTThingShadowInst__wire(void);

static inline void ICACHE_FLASH_ATTR awsIoTThingShadowInstances_thingShadowStack_mqttClientInst__wire(void);

static inline void ICACHE_FLASH_ATTR awsIoTThingShadowInstances_thingShadowStack_espConnClientInst__wire(void);

static inline void ICACHE_FLASH_ATTR awsIoTThingShadowInstances_thingShadowStack_dnsClientInst__wire(void);

static inline void ICACHE_FLASH_ATTR awsIoTThingShadowInstances_thingShadowStack_datagramPoolInst__wire(void);

static inline void ICACHE_FLASH_ATTR awsIoTThingShadowInstances_thingShadowStack_jsonProcessorInst__wire(void);

static inline void ICACHE_FLASH_ATTR awsIoTThingShadowInstances_thingShadowStack___shadow__wire(void);

/* 
 * comp instance data
 */
MultiPartitionAWSIoTThingShadowIOHandlerImpl__cdata_t awsIoTThingShadowInstances_thingShadowIOHandlerInst__instance = { 0 };

IJSONDocumentIOHandler__idata_t awsIoTThingShadowInstances_thingShadowIOHandlerInst_jsonDocumentIOHandler__ops = { 0 };

/* 
 * comp instance data
 */
AWSIoTThingShadowGateImpl__cdata_t awsIoTThingShadowInstances_thingShadowStack_thingShadowGateInst__instance = { 0 };

IConnectionMonitorHandler__idata_t awsIoTThingShadowInstances_thingShadowStack_thingShadowGateInst_connectionMonitorHandler__ops = { 0 };

IIoTClientHandler__idata_t awsIoTThingShadowInstances_thingShadowStack_thingShadowGateInst_thingShadowHandler__ops = { 0 };

IFOTAUpdateStatusHandler__idata_t awsIoTThingShadowInstances_thingShadowStack_thingShadowGateInst_fotaUpdateStatusHandler__ops = { 0 };

IRunnable__idata_t awsIoTThingShadowInstances_thingShadowStack_thingShadowGateInst_runnable__ops = { 0 };

/* 
 * comp instance data
 */
AWSIoTMQTTThingShadowImpl__cdata_t awsIoTThingShadowInstances_thingShadowStack_awsIoTMQTTThingShadowInst__instance = { 0 };

IIoTClient__idata_t awsIoTThingShadowInstances_thingShadowStack_awsIoTMQTTThingShadowInst_thingShadow__ops = { 0 };

IMQTTClientHandler__idata_t awsIoTThingShadowInstances_thingShadowStack_awsIoTMQTTThingShadowInst_mqttClientHandler__ops = { 0 };

ITimerHandler__idata_t awsIoTThingShadowInstances_thingShadowStack_awsIoTMQTTThingShadowInst_timeoutHandler__ops = { 0 };

/* 
 * comp instance data
 */
MQTTClientImpl__cdata_t awsIoTThingShadowInstances_thingShadowStack_mqttClientInst__instance = { 0 };

IMQTTClient__idata_t awsIoTThingShadowInstances_thingShadowStack_mqttClientInst_mqttClient__ops = { 0 };

IClientSocketHandler__idata_t awsIoTThingShadowInstances_thingShadowStack_mqttClientInst_clientSocketHandler__ops = { 0 };

ITimerHandler__idata_t awsIoTThingShadowInstances_thingShadowStack_mqttClientInst_keepAliveTimerHandler__ops = { 0 };

ITimerHandler__idata_t awsIoTThingShadowInstances_thingShadowStack_mqttClientInst_keepAliveTimeoutHandler__ops = { 0 };

/* 
 * comp instance data
 */
ESPConnClientImpl__cdata_t awsIoTThingShadowInstances_thingShadowStack_espConnClientInst__instance = { 0 };

IDNSLookupHandler__idata_t awsIoTThingShadowInstances_thingShadowStack_espConnClientInst_dnsLookupHandler__ops = { 0 };

IClientSocket__idata_t awsIoTThingShadowInstances_thingShadowStack_espConnClientInst_clientSocket__ops = { 0 };

/* 
 * comp instance data
 */
DNSClientImpl__cdata_t awsIoTThingShadowInstances_thingShadowStack_dnsClientInst__instance = { 0 };

IDNSClient__idata_t awsIoTThingShadowInstances_thingShadowStack_dnsClientInst_dnsClient__ops = { 0 };

/* 
 * comp instance data
 */
DynamicDatagramPoolImpl__cdata_t awsIoTThingShadowInstances_thingShadowStack_datagramPoolInst__instance = { 0 };

IDatagramPool__idata_t awsIoTThingShadowInstances_thingShadowStack_datagramPoolInst_datagramPool__ops = { 0 };

/* 
 * comp instance data
 */
JSONProcessorImpl__cdata_t awsIoTThingShadowInstances_thingShadowStack_jsonProcessorInst__instance = { 0 };

IJSONParser__idata_t awsIoTThingShadowInstances_thingShadowStack_jsonProcessorInst_jsonParser__ops = { 0 };

IJSONSerializer__idata_t awsIoTThingShadowInstances_thingShadowStack_jsonProcessorInst_jsonSerializer__ops = { 0 };

/* 
 * comp instance data
 */
ESP8266AWSIoTThingShadowStack__cdata_t awsIoTThingShadowInstances_thingShadowStack___shadow__instance = { 0 };

void ICACHE_FLASH_ATTR awsIoTThingShadow_run(void)
{
  AWSIoTThingShadowGateImpl_runnable_run(&awsIoTThingShadowInstances_thingShadowStack_thingShadowGateInst__instance);
}

void ICACHE_FLASH_ATTR fotahub_onConnectionStatusChanged(ConnectionStatus_t status)
{
  fotaUpdateWorkflow_onConnectionStatusChanged(status);
  AWSIoTThingShadowGateImpl_connectionMonitorHandler_statusChanged(status, &awsIoTThingShadowInstances_thingShadowStack_thingShadowGateInst__instance);
}

void ICACHE_FLASH_ATTR fotahub_onFirmwareUpdateStatusChanged(FOTAUpdateStatus_t status)
{
  fotaUpdateWorkflow_onFirmwareUpdateStatusChanged(status);
  AWSIoTThingShadowGateImpl_fotaUpdateStatusHandler_updateStatus(status, &awsIoTThingShadowInstances_thingShadowStack_thingShadowGateInst__instance);
}

static inline void ICACHE_FLASH_ATTR awsIoTThingShadowInstances_thingShadowIOHandlerInst__wire(void)
{
  /* 
   * INSTANCE: thingShadowIOHandlerInst
   */
  /* 
   * prov port
   */
  awsIoTThingShadowInstances_thingShadowIOHandlerInst_jsonDocumentIOHandler__ops.writeOutput = &MultiPartitionAWSIoTThingShadowIOHandlerImpl_jsonDocumentIOHandler_writeOutput;
  /* 
   * prov port
   */
  awsIoTThingShadowInstances_thingShadowIOHandlerInst_jsonDocumentIOHandler__ops.readInput = &MultiPartitionAWSIoTThingShadowIOHandlerImpl_jsonDocumentIOHandler_readInput;
  /* 
   * prov port owning instance
   */
  awsIoTThingShadowInstances_thingShadowIOHandlerInst_jsonDocumentIOHandler__ops.__instance = &awsIoTThingShadowInstances_thingShadowIOHandlerInst__instance;
  
