fotahub/fotahub-device-sdk-esp8266/examples/huzzah/thingshadow/ESP8266AWSIoTThingShadowWiring.c
}

static inline void ICACHE_FLASH_ATTR awsIoTThingShadowInstances_thingShadowStack_thingShadowGateInst__wire(void)
{
  /* 
   * INSTANCE: thingShadowStack_thingShadowGateInst
   */
  awsIoTThingShadowInstances_thingShadowStack_thingShadowGateInst__instance.awsIoTThingShadowSession__field = NULL;
  awsIoTThingShadowInstances_thingShadowStack_thingShadowGateInst__instance.updateAvailable__field = false;
  /* 
   * prov port
   */
  awsIoTThingShadowInstances_thingShadowStack_thingShadowGateInst_connectionMonitorHandler__ops.statusChanged = &AWSIoTThingShadowGateImpl_connectionMonitorHandler_statusChanged;
  /* 
   * prov port
   */
  awsIoTThingShadowInstances_thingShadowStack_thingShadowGateInst_thingShadowHandler__ops.connected = &AWSIoTThingShadowGateImpl_thingShadowHandler_connected;
  /* 
   * prov port
   */
  awsIoTThingShadowInstances_thingShadowStack_thingShadowGateInst_thingShadowHandler__ops.status = &AWSIoTThingShadowGateImpl_thingShadowHandler_status;
  /* 
   * prov port
   */
  awsIoTThingShadowInstances_thingShadowStack_thingShadowGateInst_thingShadowHandler__ops.desired = &AWSIoTThingShadowGateImpl_thingShadowHandler_desired;
  /* 
   * prov port
   */
  awsIoTThingShadowInstances_thingShadowStack_thingShadowGateInst_thingShadowHandler__ops.disconnected = &AWSIoTThingShadowGateImpl_thingShadowHandler_disconnected;
  /* 
   * prov port
   */
  awsIoTThingShadowInstances_thingShadowStack_thingShadowGateInst_thingShadowHandler__ops.connectionError = &AWSIoTThingShadowGateImpl_thingShadowHandler_connectionError;
  /* 
   * prov port
   */
  awsIoTThingShadowInstances_thingShadowStack_thingShadowGateInst_fotaUpdateStatusHandler__ops.updateStatus = &AWSIoTThingShadowGateImpl_fotaUpdateStatusHandler_updateStatus;
  /* 
   * prov port
   */
  awsIoTThingShadowInstances_thingShadowStack_thingShadowGateInst_runnable__ops.run = &AWSIoTThingShadowGateImpl_runnable_run;
  /* 
   * prov port owning instance
   */
  awsIoTThingShadowInstances_thingShadowStack_thingShadowGateInst_connectionMonitorHandler__ops.__instance = &awsIoTThingShadowInstances_thingShadowStack_thingShadowGateInst__instance;
  /* 
   * prov port owning instance
   */
  awsIoTThingShadowInstances_thingShadowStack_thingShadowGateInst_thingShadowHandler__ops.__instance = &awsIoTThingShadowInstances_thingShadowStack_thingShadowGateInst__instance;
  /* 
   * prov port owning instance
   */
  awsIoTThingShadowInstances_thingShadowStack_thingShadowGateInst_fotaUpdateStatusHandler__ops.__instance = &awsIoTThingShadowInstances_thingShadowStack_thingShadowGateInst__instance;
  /* 
   * prov port owning instance
   */
  awsIoTThingShadowInstances_thingShadowStack_thingShadowGateInst_runnable__ops.__instance = &awsIoTThingShadowInstances_thingShadowStack_thingShadowGateInst__instance;
  /* 
   * connected req sr port
   */
  awsIoTThingShadowInstances_thingShadowStack_thingShadowGateInst__instance.firmwareUpdateVersionInfo__port = &awsIoTThingShadowInstances_thingShadowIOHandlerInst__instance.firmwareUpdateVersionInfo__srdata;
  /* 
   * required port ops
   */
  awsIoTThingShadowInstances_thingShadowStack_thingShadowGateInst__instance.jsonDocumentIOHandler__ops = &awsIoTThingShadowInstances_thingShadowIOHandlerInst_jsonDocumentIOHandler__ops;
  /* 
   * required port ops
   */
  awsIoTThingShadowInstances_thingShadowStack_thingShadowGateInst__instance.thingShadow__ops = &awsIoTThingShadowInstances_thingShadowStack_awsIoTMQTTThingShadowInst_thingShadow__ops;
  /* 
   * required port ops
   */
  awsIoTThingShadowInstances_thingShadowStack_thingShadowGateInst__instance.jsonParser__ops = &awsIoTThingShadowInstances_thingShadowStack_jsonProcessorInst_jsonParser__ops;
  /* 
   * required port ops
   */
  awsIoTThingShadowInstances_thingShadowStack_thingShadowGateInst__instance.jsonSerializer__ops = &awsIoTThingShadowInstances_thingShadowStack_jsonProcessorInst_jsonSerializer__ops;
  
}

static inline void ICACHE_FLASH_ATTR awsIoTThingShadowInstances_thingShadowStack_awsIoTMQTTThingShadowInst__wire(void)
{
  /* 
   * INSTANCE: thingShadowStack_awsIoTMQTTThingShadowInst
   */
  memset(awsIoTThingShadowInstances_thingShadowStack_awsIoTMQTTThingShadowInst__instance.baseComponentData.awsIoTRequests__field, 0, sizeof(awsIoTThingShadowInstances_thingShadowStack_awsIoTMQTTThingShadowInst__instance.baseComponentData.awsIoTRequests__field));
  /* 
   * prov port
   */
  awsIoTThingShadowInstances_thingShadowStack_awsIoTMQTTThingShadowInst_thingShadow__ops.connect = &AWSIoTMQTTThingShadowImpl_thingShadow_connect;
  /* 
   * prov port
   */
  awsIoTThingShadowInstances_thingShadowStack_awsIoTMQTTThingShadowInst_thingShadow__ops.getUserData = &AbstractAWSIoTMQTTThingShadowImpl_thingShadow_getUserData;
  /* 
   * prov port
   */
  awsIoTThingShadowInstances_thingShadowStack_awsIoTMQTTThingShadowInst_thingShadow__ops.isConnected = &AbstractAWSIoTMQTTThingShadowImpl_thingShadow_isConnected;
  /* 
   * prov port
   */
  awsIoTThingShadowInstances_thingShadowStack_awsIoTMQTTThingShadowInst_thingShadow__ops.report = &AbstractAWSIoTMQTTThingShadowImpl_thingShadow_report;
  /* 
   * prov port
   */
  awsIoTThingShadowInstances_thingShadowStack_awsIoTMQTTThingShadowInst_thingShadow__ops.get = &AbstractAWSIoTMQTTThingShadowImpl_thingShadow_get;
  /* 
   * prov port
   */
  awsIoTThingShadowInstances_thingShadowStack_awsIoTMQTTThingShadowInst_thingShadow__ops.disconnect = &AbstractAWSIoTMQTTThingShadowImpl_thingShadow_disconnect;
  /* 
   * prov port
   */
  awsIoTThingShadowInstances_thingShadowStack_awsIoTMQTTThingShadowInst_mqttClientHandler__ops.connected = &AbstractAWSIoTMQTTThingShadowImpl_mqttClientHandler_connected;
  /* 
   * prov port
   */
  awsIoTThingShadowInstances_thingShadowStack_awsIoTMQTTThingShadowInst_mqttClientHandler__ops.subscribed = &AbstractAWSIoTMQTTThingShadowImpl_mqttClientHandler_subscribed;
  /* 
   * prov port
   */
  awsIoTThingShadowInstances_thingShadowStack_awsIoTMQTTThingShadowInst_mqttClientHandler__ops.published = &AbstractAWSIoTMQTTThingShadowImpl_mqttClientHandler_published;
  /* 
   * prov port
   */
  awsIoTThingShadowInstances_thingShadowStack_awsIoTMQTTThingShadowInst_mqttClientHandler__ops.publishMessageReceived = &AbstractAWSIoTMQTTThingShadowImpl_mqttClientHandler_publishMessageReceived;
  /* 
   * prov port
   */
  awsIoTThingShadowInstances_thingShadowStack_awsIoTMQTTThingShadowInst_mqttClientHandler__ops.disconnected = &AbstractAWSIoTMQTTThingShadowImpl_mqttClientHandler_disconnected;
  /* 
   * prov port
   */
  awsIoTThingShadowInstances_thingShadowStack_awsIoTMQTTThingShadowInst_mqttClientHandler__ops.connectionError = &AbstractAWSIoTMQTTThingShadowImpl_mqttClientHandler_connectionError;
  /* 
   * prov port
   */
  awsIoTThingShadowInstances_thingShadowStack_awsIoTMQTTThingShadowInst_timeoutHandler__ops.expired = &AbstractAWSIoTMQTTThingShadowImpl_timeoutHandler_expired;
  /* 
   * prov port owning instance
   */
  awsIoTThingShadowInstances_thingShadowStack_awsIoTMQTTThingShadowInst_thingShadow__ops.__instance = &awsIoTThingShadowInstances_thingShadowStack_awsIoTMQTTThingShadowInst__instance;
  /* 
   * prov port owning instance
   */
  awsIoTThingShadowInstances_thingShadowStack_awsIoTMQTTThingShadowInst_mqttClientHandler__ops.__instance = &awsIoTThingShadowInstances_thingShadowStack_awsIoTMQTTThingShadowInst__instance;
  /* 
   * prov port owning instance
   */
  awsIoTThingShadowInstances_thingShadowStack_awsIoTMQTTThingShadowInst_timeoutHandler__ops.__instance = &awsIoTThingShadowInstances_thingShadowStack_awsIoTMQTTThingShadowInst__instance;
  /* 
   * required port ops
   */
  awsIoTThingShadowInstances_thingShadowStack_awsIoTMQTTThingShadowInst__instance.baseComponentData.mqttClient__ops = &awsIoTThingShadowInstances_thingShadowStack_mqttClientInst_mqttClient__ops;
  /* 
   * required port ops
   */
  awsIoTThingShadowInstances_thingShadowStack_awsIoTMQTTThingShadowInst__instance.baseComponentData.thingShadowHandlers__ops[0] = &awsIoTThingShadowInstances_thingShadowStack_thingShadowGateInst_thingShadowHandler__ops;
  
