fotahub/fotahub-device-sdk-esp8266/examples/huzzah/thingshadow/ESP8266AWSIoTThingShadowWiring.c
  /* 
   * implements
   */
  awsIoTThingShadowInstances_thingShadowStack_awsIoTMQTTThingShadowInst__instance.baseComponentData.thingShadow_connect__abstract = &AWSIoTMQTTThingShadowImpl_thingShadow_connect;
}

static inline void ICACHE_FLASH_ATTR awsIoTThingShadowInstances_thingShadowStack_mqttClientInst__wire(void)
{
  /* 
   * INSTANCE: thingShadowStack_mqttClientInst
   */
  memset(awsIoTThingShadowInstances_thingShadowStack_mqttClientInst__instance.mqttSessions__field, 0, sizeof(awsIoTThingShadowInstances_thingShadowStack_mqttClientInst__instance.mqttSessions__field));
  /* 
   * prov port
   */
  awsIoTThingShadowInstances_thingShadowStack_mqttClientInst_mqttClient__ops.connect = &MQTTClientImpl_mqttClient_connect;
  /* 
   * prov port
   */
  awsIoTThingShadowInstances_thingShadowStack_mqttClientInst_mqttClient__ops.isConnected = &MQTTClientImpl_mqttClient_isConnected;
  /* 
   * prov port
   */
  awsIoTThingShadowInstances_thingShadowStack_mqttClientInst_mqttClient__ops.getUserData = &MQTTClientImpl_mqttClient_getUserData;
  /* 
   * prov port
   */
  awsIoTThingShadowInstances_thingShadowStack_mqttClientInst_mqttClient__ops.newDatagram = &MQTTClientImpl_mqttClient_newDatagram;
  /* 
   * prov port
   */
  awsIoTThingShadowInstances_thingShadowStack_mqttClientInst_mqttClient__ops.newPublishMessage = &MQTTClientImpl_mqttClient_newPublishMessage;
  /* 
   * prov port
   */
  awsIoTThingShadowInstances_thingShadowStack_mqttClientInst_mqttClient__ops.subscribe = &MQTTClientImpl_mqttClient_subscribe;
  /* 
   * prov port
   */
  awsIoTThingShadowInstances_thingShadowStack_mqttClientInst_mqttClient__ops.sendPublishMessage = &MQTTClientImpl_mqttClient_sendPublishMessage;
  /* 
   * prov port
   */
  awsIoTThingShadowInstances_thingShadowStack_mqttClientInst_mqttClient__ops.deleteDatagram = &MQTTClientImpl_mqttClient_deleteDatagram;
  /* 
   * prov port
   */
  awsIoTThingShadowInstances_thingShadowStack_mqttClientInst_mqttClient__ops.disconnect = &MQTTClientImpl_mqttClient_disconnect;
  /* 
   * prov port
   */
  awsIoTThingShadowInstances_thingShadowStack_mqttClientInst_clientSocketHandler__ops.connected = &MQTTClientImpl_clientSocketHandler_connected;
  /* 
   * prov port
   */
  awsIoTThingShadowInstances_thingShadowStack_mqttClientInst_clientSocketHandler__ops.datagramSent = &MQTTClientImpl_clientSocketHandler_datagramSent;
  /* 
   * prov port
   */
  awsIoTThingShadowInstances_thingShadowStack_mqttClientInst_clientSocketHandler__ops.datagramReceived = &MQTTClientImpl_clientSocketHandler_datagramReceived;
  /* 
   * prov port
   */
  awsIoTThingShadowInstances_thingShadowStack_mqttClientInst_clientSocketHandler__ops.disconnected = &MQTTClientImpl_clientSocketHandler_disconnected;
  /* 
   * prov port
   */
  awsIoTThingShadowInstances_thingShadowStack_mqttClientInst_clientSocketHandler__ops.connectionError = &MQTTClientImpl_clientSocketHandler_connectionError;
  /* 
   * prov port
   */
  awsIoTThingShadowInstances_thingShadowStack_mqttClientInst_keepAliveTimerHandler__ops.expired = &MQTTClientImpl_keepAliveTimerHandler_expired;
  /* 
   * prov port
   */
  awsIoTThingShadowInstances_thingShadowStack_mqttClientInst_keepAliveTimeoutHandler__ops.expired = &MQTTClientImpl_keepAliveTimeoutHandler_expired;
  /* 
   * prov port owning instance
   */
  awsIoTThingShadowInstances_thingShadowStack_mqttClientInst_mqttClient__ops.__instance = &awsIoTThingShadowInstances_thingShadowStack_mqttClientInst__instance;
  /* 
   * prov port owning instance
   */
  awsIoTThingShadowInstances_thingShadowStack_mqttClientInst_clientSocketHandler__ops.__instance = &awsIoTThingShadowInstances_thingShadowStack_mqttClientInst__instance;
  /* 
   * prov port owning instance
   */
  awsIoTThingShadowInstances_thingShadowStack_mqttClientInst_keepAliveTimerHandler__ops.__instance = &awsIoTThingShadowInstances_thingShadowStack_mqttClientInst__instance;
  /* 
   * prov port owning instance
   */
  awsIoTThingShadowInstances_thingShadowStack_mqttClientInst_keepAliveTimeoutHandler__ops.__instance = &awsIoTThingShadowInstances_thingShadowStack_mqttClientInst__instance;
  /* 
   * required port ops
   */
  awsIoTThingShadowInstances_thingShadowStack_mqttClientInst__instance.socket__ops = &awsIoTThingShadowInstances_thingShadowStack_espConnClientInst_clientSocket__ops;
  /* 
   * required port ops
   */
  awsIoTThingShadowInstances_thingShadowStack_mqttClientInst__instance.mqttClientHandler__ops = &awsIoTThingShadowInstances_thingShadowStack_awsIoTMQTTThingShadowInst_mqttClientHandler__ops;
  
}

static inline void ICACHE_FLASH_ATTR awsIoTThingShadowInstances_thingShadowStack_espConnClientInst__wire(void)
{
  /* 
   * INSTANCE: thingShadowStack_espConnClientInst
   */
  /* 
   * prov port
   */
  awsIoTThingShadowInstances_thingShadowStack_espConnClientInst_dnsLookupHandler__ops.hostNameResolved = &ESPConnClientImpl_dnsLookupHandler_hostNameResolved;
  /* 
   * prov port
   */
  awsIoTThingShadowInstances_thingShadowStack_espConnClientInst_clientSocket__ops.connect = &ESPConnClientImpl_clientSocket_connect;
  /* 
   * prov port
   */
  awsIoTThingShadowInstances_thingShadowStack_espConnClientInst_clientSocket__ops.isConnected = &ESPConnClientImpl_clientSocket_isConnected;
  /* 
   * prov port
   */
  awsIoTThingShadowInstances_thingShadowStack_espConnClientInst_clientSocket__ops.getUserData = &ESPConnClientImpl_clientSocket_getUserData;
  /* 
   * prov port
   */
  awsIoTThingShadowInstances_thingShadowStack_espConnClientInst_clientSocket__ops.newDatagram = &ESPConnClientImpl_clientSocket_newDatagram;
  /* 
   * prov port
   */
  awsIoTThingShadowInstances_thingShadowStack_espConnClientInst_clientSocket__ops.resizeDatagram = &ESPConnClientImpl_clientSocket_resizeDatagram;
  /* 
   * prov port
   */
  awsIoTThingShadowInstances_thingShadowStack_espConnClientInst_clientSocket__ops.sendDatagram = &ESPConnClientImpl_clientSocket_sendDatagram;
  /* 
   * prov port
   */
  awsIoTThingShadowInstances_thingShadowStack_espConnClientInst_clientSocket__ops.deleteDatagram = &ESPConnClientImpl_clientSocket_deleteDatagram;
  /* 
   * prov port
   */
  awsIoTThingShadowInstances_thingShadowStack_espConnClientInst_clientSocket__ops.disconnect = &ESPConnClientImpl_clientSocket_disconnect;
  /* 
   * prov port owning instance
   */
  awsIoTThingShadowInstances_thingShadowStack_espConnClientInst_dnsLookupHandler__ops.__instance = &awsIoTThingShadowInstances_thingShadowStack_espConnClientInst__instance;
  /* 
   * prov port owning instance
   */
  awsIoTThingShadowInstances_thingShadowStack_espConnClientInst_clientSocket__ops.__instance = &awsIoTThingShadowInstances_thingShadowStack_espConnClientInst__instance;
  /* 
   * required port ops
   */
  awsIoTThingShadowInstances_thingShadowStack_espConnClientInst__instance.dnsClient__ops = &awsIoTThingShadowInstances_thingShadowStack_dnsClientInst_dnsClient__ops;
  /* 
   * required port ops
   */
  awsIoTThingShadowInstances_thingShadowStack_espConnClientInst__instance.datagramPool__ops = &awsIoTThingShadowInstances_thingShadowStack_datagramPoolInst_datagramPool__ops;
  /* 
   * required port ops
   */
  awsIoTThingShadowInstances_thingShadowStack_espConnClientInst__instance.clientSocketHandlers__ops[0] = &awsIoTThingShadowInstances_thingShadowStack_mqttClientInst_clientSocketHandler__ops;
  
