fotahub/fotahub-device-sdk-esp8266/examples/huzzah/thingshadow/ESP8266AWSIoTThingShadowWiring.c
}

static inline void ICACHE_FLASH_ATTR awsIoTThingShadowInstances_thingShadowStack_dnsClientInst__wire(void)
{
  /* 
   * INSTANCE: thingShadowStack_dnsClientInst
   */
  /* 
   * prov port
   */
  awsIoTThingShadowInstances_thingShadowStack_dnsClientInst_dnsClient__ops.resolveHostName = &DNSClientImpl_dnsClient_resolveHostName;
  /* 
   * prov port owning instance
   */
  awsIoTThingShadowInstances_thingShadowStack_dnsClientInst_dnsClient__ops.__instance = &awsIoTThingShadowInstances_thingShadowStack_dnsClientInst__instance;
  /* 
   * required port ops
   */
  awsIoTThingShadowInstances_thingShadowStack_dnsClientInst__instance.dnsLookupHandler__ops = &awsIoTThingShadowInstances_thingShadowStack_espConnClientInst_dnsLookupHandler__ops;
  
}

static inline void ICACHE_FLASH_ATTR awsIoTThingShadowInstances_thingShadowStack_datagramPoolInst__wire(void)
{
  /* 
   * INSTANCE: thingShadowStack_datagramPoolInst
   */
  /* 
   * prov port
   */
  awsIoTThingShadowInstances_thingShadowStack_datagramPoolInst_datagramPool__ops.newDatagram = &DynamicDatagramPoolImpl_datagramPool_newDatagram;
  /* 
   * prov port
   */
  awsIoTThingShadowInstances_thingShadowStack_datagramPoolInst_datagramPool__ops.resizeDatagram = &DynamicDatagramPoolImpl_datagramPool_resizeDatagram;
  /* 
   * prov port
   */
  awsIoTThingShadowInstances_thingShadowStack_datagramPoolInst_datagramPool__ops.deleteDatagram = &DynamicDatagramPoolImpl_datagramPool_deleteDatagram;
  /* 
   * prov port owning instance
   */
  awsIoTThingShadowInstances_thingShadowStack_datagramPoolInst_datagramPool__ops.__instance = &awsIoTThingShadowInstances_thingShadowStack_datagramPoolInst__instance;
  
}

static inline void ICACHE_FLASH_ATTR awsIoTThingShadowInstances_thingShadowStack_jsonProcessorInst__wire(void)
{
  /* 
   * INSTANCE: thingShadowStack_jsonProcessorInst
   */
  /* 
   * prov port
   */
  awsIoTThingShadowInstances_thingShadowStack_jsonProcessorInst_jsonParser__ops.parse = &JSONProcessorImpl_jsonParser_parse;
  /* 
   * prov port
   */
  awsIoTThingShadowInstances_thingShadowStack_jsonProcessorInst_jsonParser__ops.resetFlags = &JSONProcessorImpl_jsonParser_resetFlags;
  /* 
   * prov port
   */
  awsIoTThingShadowInstances_thingShadowStack_jsonProcessorInst_jsonSerializer__ops.serialize = &JSONProcessorImpl_jsonSerializer_serialize;
  /* 
   * prov port
   */
  awsIoTThingShadowInstances_thingShadowStack_jsonProcessorInst_jsonSerializer__ops.beginDocument = &JSONProcessorImpl_jsonSerializer_beginDocument;
  /* 
   * prov port
   */
  awsIoTThingShadowInstances_thingShadowStack_jsonProcessorInst_jsonSerializer__ops.beginObject = &JSONProcessorImpl_jsonSerializer_beginObject;
  /* 
   * prov port
   */
  awsIoTThingShadowInstances_thingShadowStack_jsonProcessorInst_jsonSerializer__ops.addValue = &JSONProcessorImpl_jsonSerializer_addValue;
  /* 
   * prov port
   */
  awsIoTThingShadowInstances_thingShadowStack_jsonProcessorInst_jsonSerializer__ops.endObject = &JSONProcessorImpl_jsonSerializer_endObject;
  /* 
   * prov port
   */
  awsIoTThingShadowInstances_thingShadowStack_jsonProcessorInst_jsonSerializer__ops.endDocument = &JSONProcessorImpl_jsonSerializer_endDocument;
  /* 
   * prov port owning instance
   */
  awsIoTThingShadowInstances_thingShadowStack_jsonProcessorInst_jsonParser__ops.__instance = &awsIoTThingShadowInstances_thingShadowStack_jsonProcessorInst__instance;
  /* 
   * prov port owning instance
   */
  awsIoTThingShadowInstances_thingShadowStack_jsonProcessorInst_jsonSerializer__ops.__instance = &awsIoTThingShadowInstances_thingShadowStack_jsonProcessorInst__instance;
  
}

static inline void ICACHE_FLASH_ATTR awsIoTThingShadowInstances_thingShadowStack___shadow__wire(void)
{
  /* 
   * INSTANCE: thingShadowStack___shadow
   */
  awsIoTThingShadowInstances_thingShadowStack___shadow__instance.thingShadowGateInst__field = &awsIoTThingShadowInstances_thingShadowStack_thingShadowGateInst__instance;
  awsIoTThingShadowInstances_thingShadowStack___shadow__instance.awsIoTMQTTThingShadowInst__field = &awsIoTThingShadowInstances_thingShadowStack_awsIoTMQTTThingShadowInst__instance;
  awsIoTThingShadowInstances_thingShadowStack___shadow__instance.mqttClientInst__field = &awsIoTThingShadowInstances_thingShadowStack_mqttClientInst__instance;
  awsIoTThingShadowInstances_thingShadowStack___shadow__instance.espConnClientInst__field = &awsIoTThingShadowInstances_thingShadowStack_espConnClientInst__instance;
  awsIoTThingShadowInstances_thingShadowStack___shadow__instance.dnsClientInst__field = &awsIoTThingShadowInstances_thingShadowStack_dnsClientInst__instance;
  awsIoTThingShadowInstances_thingShadowStack___shadow__instance.datagramPoolInst__field = &awsIoTThingShadowInstances_thingShadowStack_datagramPoolInst__instance;
  awsIoTThingShadowInstances_thingShadowStack___shadow__instance.jsonProcessorInst__field = &awsIoTThingShadowInstances_thingShadowStack_jsonProcessorInst__instance;
  /* 
   * connected req sr port
   */
  awsIoTThingShadowInstances_thingShadowStack___shadow__instance.firmwareUpdateVersionInfo__port = &awsIoTThingShadowInstances_thingShadowIOHandlerInst__instance.firmwareUpdateVersionInfo__srdata;
  /* 
   * required port ops
   */
  awsIoTThingShadowInstances_thingShadowStack___shadow__instance.jSONDocumentIOHandler__ops = &awsIoTThingShadowInstances_thingShadowIOHandlerInst_jsonDocumentIOHandler__ops;
  
}

void ICACHE_FLASH_ATTR awsIoTThingShadowInstances__init(void)
{
  awsIoTThingShadowInstances_thingShadowIOHandlerInst__wire();
  awsIoTThingShadowInstances_thingShadowStack_thingShadowGateInst__wire();
  awsIoTThingShadowInstances_thingShadowStack_awsIoTMQTTThingShadowInst__wire();
  awsIoTThingShadowInstances_thingShadowStack_mqttClientInst__wire();
  awsIoTThingShadowInstances_thingShadowStack_espConnClientInst__wire();
  awsIoTThingShadowInstances_thingShadowStack_dnsClientInst__wire();
  awsIoTThingShadowInstances_thingShadowStack_datagramPoolInst__wire();
  awsIoTThingShadowInstances_thingShadowStack_jsonProcessorInst__wire();
  awsIoTThingShadowInstances_thingShadowStack___shadow__wire();
  
  void *___componentInstance = NULL;
  ___componentInstance = &awsIoTThingShadowInstances_thingShadowIOHandlerInst__instance;
  MultiPartitionAWSIoTThingShadowIOHandlerImpl_init(___componentInstance);
  ___componentInstance = &awsIoTThingShadowInstances_thingShadowStack___shadow__instance;
  ESP8266AWSIoTThingShadowStack___setup(___componentInstance);
}
